Autodesk.Revit.DB.Structure.AnalyticalModelStick.SetMemberForces(Autodesk.Revit.DB.Structure.MemberForces)
Sets Member Forces to element.
Remarks:
If element already have member forces defined for that end, newly provided values replace current one.
memberForces:
End to which member forces will be added is defined by setting Autodesk::Revit::DB::Structure::MemberForces::Position
property in provided Member Forces object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.AnalyticalModelStick.SetMemberForces(System.Boolean,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Adds Member Forces to element.
Remarks:
If element already have member forces defined for that end, newly provided values replace current one.
start:
Member Forces position on analytical model stick element. True for start, false for end.
force:
The translational forces at specified position of the element.
The x value of XYZ object represents force along x-axis of the analytical model coordinate system, y along y-axis, z along z-axis respectively.
moment:
The rotational forces at specified position of the element.
The x value of XYZ object represents moment about x-axis of the analytical model coordinate system, y about y-axis, z about z-axis respectively.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.AnalyticalModelStick.GetMemberForces
Gets the member forces associated with this element.
Remarks:
Using this method require transaction.
Returns:
Returns a collection of Member Forces associated with this element. Empty collection will be returned if element doesn't have any Member Forces.
To find out with which end member forces are associated use Autodesk::Revit::DB::Structure::MemberForces::Position
property to obtain a position of Member Forces on element.
Since:
2016

Autodesk.Revit.DB.Structure.AnalyticalModelStick.GetLocalCoordinateSystem(System.Double)
Gets the local coordinate system (LCS) reflects analytical model orientation at the specified parameter value along a curve.
parameter:
The parameter value along a curve that should be in the range [0, 1], where 0 represents start and 1 represents end of the element.
Returns:
Transformation matrix.
x - longitudinal axis, y - transversal, section - horizontal, strong axis, z - transversal, section - vertical, weak axis, origin - base point of LCS.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when parameter is not within the range from 0 to 1.
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelStick.GetLocalCoordinateSystem(Autodesk.Revit.DB.XYZ)
Gets the local coordinate system (LCS) reflects analytical model orientation at the specified point.
point:
The point on the analytical model stick element.
Returns:
Transformation matrix.
x - longitudinal axis, y - transversal, section - horizontal, strong axis, z - transversal, section - vertical, weak axis, origin - base point of LCS.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when called with point that not lie on the analytical model stick element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015